{
  "class_name": "Model",
  "config": {
    "name": "model_2",
    "layers": [
      {
        "name": "input_2",
        "class_name": "InputLayer",
        "config": {
          "batch_input_shape": [
            null,
            48,
            48,
            1
          ],
          "dtype": "float32",
          "sparse": false,
          "name": "input_2"
        },
        "inbound_nodes": []
      },
      {
        "name": "conv2d_125",
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_125",
          "trainable": true,
          "batch_input_shape": [
            null,
            48,
            48,
            1
          ],
          "dtype": "float32",
          "filters": 64,
          "kernel_size": [
            7,
            7
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "input_2",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_122",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_122",
          "trainable": true,
          "batch_input_shape": [
            null,
            48,
            48,
            64
          ],
          "dtype": "float32",
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "conv2d_125",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_126",
        "class_name": "Activation",
        "config": {
          "name": "activation_126",
          "trainable": true,
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "batch_normalization_122",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "max_pooling2d_9",
        "class_name": "MaxPooling2D",
        "config": {
          "name": "max_pooling2d_9",
          "trainable": true,
          "pool_size": [
            2,
            2
          ],
          "padding": "valid",
          "strides": [
            2,
            2
          ],
          "data_format": "channels_last"
        },
        "inbound_nodes": [
          [
            [
              "activation_126",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_123",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_123",
          "trainable": true,
          "batch_input_shape": [
            null,
            16,
            16,
            64
          ],
          "dtype": "float32",
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "max_pooling2d_9",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_127",
        "class_name": "Activation",
        "config": {
          "name": "activation_127",
          "trainable": true,
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "batch_normalization_123",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv2d_126",
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_126",
          "trainable": true,
          "batch_input_shape": [
            null,
            16,
            16,
            64
          ],
          "dtype": "float32",
          "filters": 128,
          "kernel_size": [
            1,
            1
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_127",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_124",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_124",
          "trainable": true,
          "batch_input_shape": [
            null,
            16,
            16,
            128
          ],
          "dtype": "float32",
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "conv2d_126",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_128",
        "class_name": "Activation",
        "config": {
          "name": "activation_128",
          "trainable": true,
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "batch_normalization_124",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv2d_127",
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_127",
          "trainable": true,
          "batch_input_shape": [
            null,
            16,
            16,
            128
          ],
          "dtype": "float32",
          "filters": 32,
          "kernel_size": [
            3,
            3
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_128",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "spatial_dropout2d_59",
        "class_name": "SpatialDropout2D",
        "config": {
          "name": "spatial_dropout2d_59",
          "trainable": true,
          "rate": 0,
          "noise_shape": null,
          "seed": null
        },
        "inbound_nodes": [
          [
            [
              "conv2d_127",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "concatenate_59",
        "class_name": "Concatenate",
        "config": {
          "name": "concatenate_59",
          "trainable": true,
          "axis": -1
        },
        "inbound_nodes": [
          [
            [
              "max_pooling2d_9",
              0,
              0,
              {}
            ],
            [
              "spatial_dropout2d_59",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_125",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_125",
          "trainable": true,
          "batch_input_shape": [
            null,
            16,
            16,
            96
          ],
          "dtype": "float32",
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "concatenate_59",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_129",
        "class_name": "Activation",
        "config": {
          "name": "activation_129",
          "trainable": true,
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "batch_normalization_125",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv2d_128",
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_128",
          "trainable": true,
          "batch_input_shape": [
            null,
            16,
            16,
            96
          ],
          "dtype": "float32",
          "filters": 128,
          "kernel_size": [
            1,
            1
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_129",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_126",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_126",
          "trainable": true,
          "batch_input_shape": [
            null,
            16,
            16,
            128
          ],
          "dtype": "float32",
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "conv2d_128",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_130",
        "class_name": "Activation",
        "config": {
          "name": "activation_130",
          "trainable": true,
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "batch_normalization_126",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv2d_129",
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_129",
          "trainable": true,
          "batch_input_shape": [
            null,
            16,
            16,
            128
          ],
          "dtype": "float32",
          "filters": 32,
          "kernel_size": [
            3,
            3
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_130",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "spatial_dropout2d_60",
        "class_name": "SpatialDropout2D",
        "config": {
          "name": "spatial_dropout2d_60",
          "trainable": true,
          "rate": 0,
          "noise_shape": null,
          "seed": null
        },
        "inbound_nodes": [
          [
            [
              "conv2d_129",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "concatenate_60",
        "class_name": "Concatenate",
        "config": {
          "name": "concatenate_60",
          "trainable": true,
          "axis": -1
        },
        "inbound_nodes": [
          [
            [
              "concatenate_59",
              0,
              0,
              {}
            ],
            [
              "spatial_dropout2d_60",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_127",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_127",
          "trainable": true,
          "batch_input_shape": [
            null,
            16,
            16,
            128
          ],
          "dtype": "float32",
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "concatenate_60",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_131",
        "class_name": "Activation",
        "config": {
          "name": "activation_131",
          "trainable": true,
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "batch_normalization_127",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv2d_130",
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_130",
          "trainable": true,
          "batch_input_shape": [
            null,
            16,
            16,
            128
          ],
          "dtype": "float32",
          "filters": 128,
          "kernel_size": [
            1,
            1
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_131",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_128",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_128",
          "trainable": true,
          "batch_input_shape": [
            null,
            16,
            16,
            128
          ],
          "dtype": "float32",
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "conv2d_130",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_132",
        "class_name": "Activation",
        "config": {
          "name": "activation_132",
          "trainable": true,
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "batch_normalization_128",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv2d_131",
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_131",
          "trainable": true,
          "batch_input_shape": [
            null,
            16,
            16,
            128
          ],
          "dtype": "float32",
          "filters": 32,
          "kernel_size": [
            3,
            3
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_132",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "spatial_dropout2d_61",
        "class_name": "SpatialDropout2D",
        "config": {
          "name": "spatial_dropout2d_61",
          "trainable": true,
          "rate": 0,
          "noise_shape": null,
          "seed": null
        },
        "inbound_nodes": [
          [
            [
              "conv2d_131",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "concatenate_61",
        "class_name": "Concatenate",
        "config": {
          "name": "concatenate_61",
          "trainable": true,
          "axis": -1
        },
        "inbound_nodes": [
          [
            [
              "concatenate_60",
              0,
              0,
              {}
            ],
            [
              "spatial_dropout2d_61",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_129",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_129",
          "trainable": true,
          "batch_input_shape": [
            null,
            16,
            16,
            160
          ],
          "dtype": "float32",
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "concatenate_61",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_133",
        "class_name": "Activation",
        "config": {
          "name": "activation_133",
          "trainable": true,
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "batch_normalization_129",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv2d_132",
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_132",
          "trainable": true,
          "batch_input_shape": [
            null,
            16,
            16,
            160
          ],
          "dtype": "float32",
          "filters": 128,
          "kernel_size": [
            1,
            1
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_133",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_130",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_130",
          "trainable": true,
          "batch_input_shape": [
            null,
            16,
            16,
            128
          ],
          "dtype": "float32",
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "conv2d_132",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_134",
        "class_name": "Activation",
        "config": {
          "name": "activation_134",
          "trainable": true,
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "batch_normalization_130",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv2d_133",
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_133",
          "trainable": true,
          "batch_input_shape": [
            null,
            16,
            16,
            128
          ],
          "dtype": "float32",
          "filters": 32,
          "kernel_size": [
            3,
            3
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_134",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "spatial_dropout2d_62",
        "class_name": "SpatialDropout2D",
        "config": {
          "name": "spatial_dropout2d_62",
          "trainable": true,
          "rate": 0,
          "noise_shape": null,
          "seed": null
        },
        "inbound_nodes": [
          [
            [
              "conv2d_133",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "concatenate_62",
        "class_name": "Concatenate",
        "config": {
          "name": "concatenate_62",
          "trainable": true,
          "axis": -1
        },
        "inbound_nodes": [
          [
            [
              "concatenate_61",
              0,
              0,
              {}
            ],
            [
              "spatial_dropout2d_62",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_131",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_131",
          "trainable": true,
          "batch_input_shape": [
            null,
            16,
            16,
            192
          ],
          "dtype": "float32",
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "concatenate_62",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_135",
        "class_name": "Activation",
        "config": {
          "name": "activation_135",
          "trainable": true,
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "batch_normalization_131",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv2d_134",
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_134",
          "trainable": true,
          "batch_input_shape": [
            null,
            16,
            16,
            192
          ],
          "dtype": "float32",
          "filters": 128,
          "kernel_size": [
            1,
            1
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_135",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_132",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_132",
          "trainable": true,
          "batch_input_shape": [
            null,
            16,
            16,
            128
          ],
          "dtype": "float32",
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "conv2d_134",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_136",
        "class_name": "Activation",
        "config": {
          "name": "activation_136",
          "trainable": true,
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "batch_normalization_132",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv2d_135",
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_135",
          "trainable": true,
          "batch_input_shape": [
            null,
            16,
            16,
            128
          ],
          "dtype": "float32",
          "filters": 32,
          "kernel_size": [
            3,
            3
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_136",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "spatial_dropout2d_63",
        "class_name": "SpatialDropout2D",
        "config": {
          "name": "spatial_dropout2d_63",
          "trainable": true,
          "rate": 0,
          "noise_shape": null,
          "seed": null
        },
        "inbound_nodes": [
          [
            [
              "conv2d_135",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "concatenate_63",
        "class_name": "Concatenate",
        "config": {
          "name": "concatenate_63",
          "trainable": true,
          "axis": -1
        },
        "inbound_nodes": [
          [
            [
              "concatenate_62",
              0,
              0,
              {}
            ],
            [
              "spatial_dropout2d_63",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_133",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_133",
          "trainable": true,
          "batch_input_shape": [
            null,
            16,
            16,
            224
          ],
          "dtype": "float32",
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "concatenate_63",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_137",
        "class_name": "Activation",
        "config": {
          "name": "activation_137",
          "trainable": true,
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "batch_normalization_133",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv2d_136",
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_136",
          "trainable": true,
          "batch_input_shape": [
            null,
            16,
            16,
            224
          ],
          "dtype": "float32",
          "filters": 128,
          "kernel_size": [
            1,
            1
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_137",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_134",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_134",
          "trainable": true,
          "batch_input_shape": [
            null,
            16,
            16,
            128
          ],
          "dtype": "float32",
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "conv2d_136",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_138",
        "class_name": "Activation",
        "config": {
          "name": "activation_138",
          "trainable": true,
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "batch_normalization_134",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv2d_137",
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_137",
          "trainable": true,
          "batch_input_shape": [
            null,
            16,
            16,
            128
          ],
          "dtype": "float32",
          "filters": 32,
          "kernel_size": [
            3,
            3
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_138",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "spatial_dropout2d_64",
        "class_name": "SpatialDropout2D",
        "config": {
          "name": "spatial_dropout2d_64",
          "trainable": true,
          "rate": 0,
          "noise_shape": null,
          "seed": null
        },
        "inbound_nodes": [
          [
            [
              "conv2d_137",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "concatenate_64",
        "class_name": "Concatenate",
        "config": {
          "name": "concatenate_64",
          "trainable": true,
          "axis": -1
        },
        "inbound_nodes": [
          [
            [
              "concatenate_63",
              0,
              0,
              {}
            ],
            [
              "spatial_dropout2d_64",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_135",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_135",
          "trainable": true,
          "batch_input_shape": [
            null,
            16,
            16,
            256
          ],
          "dtype": "float32",
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "concatenate_64",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_139",
        "class_name": "Activation",
        "config": {
          "name": "activation_139",
          "trainable": true,
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "batch_normalization_135",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv2d_138",
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_138",
          "trainable": true,
          "batch_input_shape": [
            null,
            16,
            16,
            256
          ],
          "dtype": "float32",
          "filters": 128,
          "kernel_size": [
            1,
            1
          ],
          "strides": [
