{
   "backend":"tensorflow",
   "keras_version":"2.0.8",
   "class_name":"Model",
   "config":{
      "output_layers":[
         [
            "predictions",
            0,
            0
         ]
      ],
      "layers":[
         {
            "class_name":"InputLayer",
            "name":"input_2",
            "config":{
               "dtype":"float32",
               "batch_input_shape":[
                  null,
                  null,
                  null,
                  3
               ],
               "sparse":false,
               "name":"input_2"
            },
            "inbound_nodes":[

            ]
         },
         {
            "class_name":"Conv2D",
            "name":"conv2d_95",
            "config":{
               "kernel_initializer":{
                  "class_name":"VarianceScaling",
                  "config":{
                     "scale":1.0,
                     "mode":"fan_avg",
                     "distribution":"uniform",
                     "seed":null
                  }
               },
               "kernel_size":[
                  3,
                  3
               ],
               "bias_regularizer":null,
               "activation":"linear",
               "bias_constraint":null,
               "name":"conv2d_95",
               "activity_regularizer":null,
               "padding":"valid",
               "dilation_rate":[
                  1,
                  1
               ],
               "kernel_constraint":null,
               "trainable":true,
               "kernel_regularizer":null,
               "strides":[
                  2,
                  2
               ],
               "bias_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               },
               "filters":32,
               "use_bias":false,
               "data_format":"channels_last"
            },
            "inbound_nodes":[
               [
                  [
                     "input_2",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ]
         },
         {
            "class_name":"BatchNormalization",
            "name":"batch_normalization_95",
            "config":{
               "momentum":0.99,
               "name":"batch_normalization_95",
               "epsilon":0.001,
               "axis":3,
               "scale":false,
               "beta_constraint":null,
               "gamma_initializer":{
                  "class_name":"Ones",
                  "config":{

                  }
               },
               "gamma_regularizer":null,
               "trainable":true,
               "moving_mean_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               },
               "center":true,
               "moving_variance_initializer":{
                  "class_name":"Ones",
                  "config":{

                  }
               },
               "gamma_constraint":null,
               "beta_regularizer":null,
               "beta_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               }
            },
            "inbound_nodes":[
               [
                  [
                     "conv2d_95",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ]
         },
         {
            "class_name":"Activation",
            "name":"activation_95",
            "config":{
               "activation":"relu",
               "trainable":true,
               "name":"activation_95"
            },
            "inbound_nodes":[
               [
                  [
                     "batch_normalization_95",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ]
         },
         {
            "class_name":"Conv2D",
            "name":"conv2d_96",
            "config":{
               "kernel_initializer":{
                  "class_name":"VarianceScaling",
                  "config":{
                     "scale":1.0,
                     "mode":"fan_avg",
                     "distribution":"uniform",
                     "seed":null
                  }
               },
               "kernel_size":[
                  3,
                  3
               ],
               "bias_regularizer":null,
               "activation":"linear",
               "bias_constraint":null,
               "name":"conv2d_96",
               "activity_regularizer":null,
               "padding":"valid",
               "dilation_rate":[
                  1,
                  1
               ],
               "kernel_constraint":null,
               "trainable":true,
               "kernel_regularizer":null,
               "strides":[
                  1,
                  1
               ],
               "bias_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               },
               "filters":32,
               "use_bias":false,
               "data_format":"channels_last"
            },
            "inbound_nodes":[
               [
                  [
                     "activation_95",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ]
         },
         {
            "class_name":"BatchNormalization",
            "name":"batch_normalization_96",
            "config":{
               "momentum":0.99,
               "name":"batch_normalization_96",
               "epsilon":0.001,
               "axis":3,
               "scale":false,
               "beta_constraint":null,
               "gamma_initializer":{
                  "class_name":"Ones",
                  "config":{

                  }
               },
               "gamma_regularizer":null,
               "trainable":true,
               "moving_mean_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               },
               "center":true,
               "moving_variance_initializer":{
                  "class_name":"Ones",
                  "config":{

                  }
               },
               "gamma_constraint":null,
               "beta_regularizer":null,
               "beta_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               }
            },
            "inbound_nodes":[
               [
                  [
                     "conv2d_96",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ]
         },
         {
            "class_name":"Activation",
            "name":"activation_96",
            "config":{
               "activation":"relu",
               "trainable":true,
               "name":"activation_96"
            },
            "inbound_nodes":[
               [
                  [
                     "batch_normalization_96",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ]
         },
         {
            "class_name":"Conv2D",
            "name":"conv2d_97",
            "config":{
               "kernel_initializer":{
                  "class_name":"VarianceScaling",
                  "config":{
                     "scale":1.0,
                     "mode":"fan_avg",
                     "distribution":"uniform",
                     "seed":null
                  }
               },
               "kernel_size":[
                  3,
                  3
               ],
               "bias_regularizer":null,
               "activation":"linear",
               "bias_constraint":null,
               "name":"conv2d_97",
               "activity_regularizer":null,
               "padding":"same",
               "dilation_rate":[
                  1,
                  1
               ],
               "kernel_constraint":null,
               "trainable":true,
               "kernel_regularizer":null,
               "strides":[
                  1,
                  1
               ],
               "bias_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               },
               "filters":64,
               "use_bias":false,
               "data_format":"channels_last"
            },
            "inbound_nodes":[
               [
                  [
                     "activation_96",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ]
         },
         {
            "class_name":"BatchNormalization",
            "name":"batch_normalization_97",
            "config":{
               "momentum":0.99,
               "name":"batch_normalization_97",
               "epsilon":0.001,
               "axis":3,
               "scale":false,
               "beta_constraint":null,
               "gamma_initializer":{
                  "class_name":"Ones",
                  "config":{

                  }
               },
               "gamma_regularizer":null,
               "trainable":true,
               "moving_mean_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               },
               "center":true,
               "moving_variance_initializer":{
                  "class_name":"Ones",
                  "config":{

                  }
               },
               "gamma_constraint":null,
               "beta_regularizer":null,
               "beta_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               }
            },
            "inbound_nodes":[
               [
                  [
                     "conv2d_97",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ]
         },
         {
            "class_name":"Activation",
            "name":"activation_97",
            "config":{
               "activation":"relu",
               "trainable":true,
               "name":"activation_97"
            },
            "inbound_nodes":[
               [
                  [
                     "batch_normalization_97",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ]
         },
         {
            "class_name":"MaxPooling2D",
            "name":"max_pooling2d_5",
            "config":{
               "strides":[
                  2,
                  2
               ],
               "pool_size":[
                  3,
                  3
               ],
               "name":"max_pooling2d_5",
               "padding":"valid",
               "data_format":"channels_last",
               "trainable":true
            },
            "inbound_nodes":[
               [
                  [
                     "activation_97",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ]
         },
         {
            "class_name":"Conv2D",
            "name":"conv2d_98",
            "config":{
               "kernel_initializer":{
                  "class_name":"VarianceScaling",
                  "config":{
                     "scale":1.0,
                     "mode":"fan_avg",
                     "distribution":"uniform",
                     "seed":null
                  }
               },
               "kernel_size":[
                  1,
                  1
               ],
               "bias_regularizer":null,
               "activation":"linear",
               "bias_constraint":null,
               "name":"conv2d_98",
               "activity_regularizer":null,
               "padding":"valid",
               "dilation_rate":[
                  1,
                  1
               ],
               "kernel_constraint":null,
               "trainable":true,
               "kernel_regularizer":null,
               "strides":[
                  1,
                  1
               ],
               "bias_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               },
               "filters":80,
               "use_bias":false,
               "data_format":"channels_last"
            },
            "inbound_nodes":[
               [
                  [
                     "max_pooling2d_5",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ]
         },
         {
            "class_name":"BatchNormalization",
            "name":"batch_normalization_98",
            "config":{
               "momentum":0.99,
               "name":"batch_normalization_98",
               "epsilon":0.001,
               "axis":3,
               "scale":false,
               "beta_constraint":null,
               "gamma_initializer":{
                  "class_name":"Ones",
                  "config":{

                  }
               },
               "gamma_regularizer":null,
               "trainable":true,
               "moving_mean_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               },
               "center":true,
               "moving_variance_initializer":{
                  "class_name":"Ones",
                  "config":{

                  }
               },
               "gamma_constraint":null,
               "beta_regularizer":null,
               "beta_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               }
            },
            "inbound_nodes":[
               [
                  [
                     "conv2d_98",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ]
         },
         {
            "class_name":"Activation",
            "name":"activation_98",
            "config":{
               "activation":"relu",
               "trainable":true,
               "name":"activation_98"
            },
            "inbound_nodes":[
               [
                  [
                     "batch_normalization_98",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ]
         },
         {
            "class_name":"Conv2D",
            "name":"conv2d_99",
            "config":{
               "kernel_initializer":{
                  "class_name":"VarianceScaling",
                  "config":{
                     "scale":1.0,
                     "mode":"fan_avg",
                     "distribution":"uniform",
                     "seed":null
                  }
               },
               "kernel_size":[
                  3,
                  3
               ],
               "bias_regularizer":null,
               "activation":"linear",
               "bias_constraint":null,
               "name":"conv2d_99",
               "activity_regularizer":null,
               "padding":"valid",
               "dilation_rate":[
                  1,
                  1
               ],
               "kernel_constraint":null,
               "trainable":true,
               "kernel_regularizer":null,
               "strides":[
                  1,
                  1
               ],
               "bias_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               },
               "filters":192,
               "use_bias":false,
               "data_format":"channels_last"
            },
            "inbound_nodes":[
               [
                  [
                     "activation_98",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ]
         },
         {
            "class_name":"BatchNormalization",
            "name":"batch_normalization_99",
            "config":{
               "momentum":0.99,
               "name":"batch_normalization_99",
               "epsilon":0.001,
               "axis":3,
               "scale":false,
               "beta_constraint":null,
               "gamma_initializer":{
                  "class_name":"Ones",
                  "config":{

                  }
               },
               "gamma_regularizer":null,
               "trainable":true,
               "moving_mean_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               },
               "center":true,
               "moving_variance_initializer":{
                  "class_name":"Ones",
                  "config":{

                  }
               },
               "gamma_constraint":null,
               "beta_regularizer":null,
               "beta_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               }
            },
            "inbound_nodes":[
               [
                  [
                     "conv2d_99",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ]
         },
         {
            "class_name":"Activation",
            "name":"activation_99",
            "config":{
               "activation":"relu",
               "trainable":true,
               "name":"activation_99"
            },
            "inbound_nodes":[
               [
                  [
                     "batch_normalization_99",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ]
         },
         {
            "class_name":"MaxPooling2D",
            "name":"max_pooling2d_6",
            "config":{
               "strides":[
                  2,
                  2
               ],
               "pool_size":[
                  3,
                  3
               ],
               "name":"max_pooling2d_6",
               "padding":"valid",
               "data_format":"channels_last",
               "trainable":true
            },
            "inbound_nodes":[
               [
                  [
                     "activation_99",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ]
         },
         {
            "class_name":"Conv2D",
            "name":"conv2d_103",
            "config":{
               "kernel_initializer":{
                  "class_name":"VarianceScaling",
                  "config":{
                     "scale":1.0,
                     "mode":"fan_avg",
                     "distribution":"uniform",
                     "seed":null
                  }
               },
               "kernel_size":[
                  1,
                  1
               ],
               "bias_regularizer":null,
               "activation":"linear",
               "bias_constraint":null,
               "name":"conv2d_103",
               "activity_regularizer":null,
               "padding":"same",
               "dilation_rate":[
                  1,
                  1
               ],
               "kernel_constraint":null,
               "trainable":true,
               "kernel_regularizer":null,
               "strides":[
                  1,
                  1
               ],
               "bias_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               },
               "filters":64,
               "use_bias":false,
               "data_format":"channels_last"
            },
            "inbound_nodes":[
               [
                  [
                     "max_pooling2d_6",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ]
         },
         {
            "class_name":"BatchNormalization",
            "name":"batch_normalization_103",
            "config":{
               "momentum":0.99,
               "name":"batch_normalization_103",
               "epsilon":0.001,
               "axis":3,
               "scale":false,
               "beta_constraint":null,
               "gamma_initializer":{
                  "class_name":"Ones",
                  "config":{

                  }
               },
               "gamma_regularizer":null,
               "trainable":true,
               "moving_mean_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               },
               "center":true,
               "moving_variance_initializer":{
                  "class_name":"Ones",
                  "config":{

                  }
               },
               "gamma_constraint":null,
               "beta_regularizer":null,
               "beta_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               }
            },
            "inbound_nodes":[
               [
                  [
                     "conv2d_103",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ]
         },
         {
            "class_name":"Activation",
            "name":"activation_103",
            "config":{
               "activation":"relu",
               "trainable":true,
               "name":"activation_103"
            },
            "inbound_nodes":[
               [
                  [
                     "batch_normalization_103",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ]
         },
         {
            "class_name":"Conv2D",
            "name":"conv2d_101",
            "config":{
               "kernel_initializer":{
                  "class_name":"VarianceScaling",
                  "config":{
                     "scale":1.0,
                     "mode":"fan_avg",
                     "distribution":"uniform",
                     "seed":null
                  }
               },
               "kernel_size":[
                  1,
                  1
               ],
               "bias_regularizer":null,
               "activation":"linear",
               "bias_constraint":null,
               "name":"conv2d_101",
               "activity_regularizer":null,
               "padding":"same",
               "dilation_rate":[
                  1,
                  1
               ],
               "kernel_constraint":null,
               "trainable":true,
               "kernel_regularizer":null,
               "strides":[
                  1,
                  1
               ],
               "bias_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               },
               "filters":48,
               "use_bias":false,
               "data_format":"channels_last"
            },
            "inbound_nodes":[
               [
                  [
                     "max_pooling2d_6",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ]
         },
         {
            "class_name":"Conv2D",
            "name":"conv2d_104",
            "config":{
               "kernel_initializer":{
                  "class_name":"VarianceScaling",
                  "config":{
                     "scale":1.0,
                     "mode":"fan_avg",
                     "distribution":"uniform",
                     "seed":null
                  }
               },
               "kernel_size":[
                  3,
                  3
               ],
               "bias_regularizer":null,
               "activation":"linear",
               "bias_constraint":null,
               "name":"conv2d_104",
               "activity_regularizer":null,
               "padding":"same",
               "dilation_rate":[
                  1,
                  1
               ],
               "kernel_constraint":null,
               "trainable":true,
               "kernel_regularizer":null,
               "strides":[
                  1,
                  1
               ],
               "bias_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               },
               "filters":96,
               "use_bias":false,
               "data_format":"channels_last"
            },
            "inbound_nodes":[
               [
                  [
                     "activation_103",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ]
         },
         {
            "class_name":"BatchNormalization",
            "name":"batch_normalization_101",
            "config":{
               "momentum":0.99,
               "name":"batch_normalization_101",
               "epsilon":0.001,
               "axis":3,
               "scale":false,
               "beta_constraint":null,
               "gamma_initializer":{
                  "class_name":"Ones",
                  "config":{

                  }
               },
               "gamma_regularizer":null,
               "trainable":true,
               "moving_mean_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               },
               "center":true,
               "moving_variance_initializer":{
                  "class_name":"Ones",
                  "config":{

                  }
               },
               "gamma_constraint":null,
               "beta_regularizer":null,
               "beta_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               }
            },
            "inbound_nodes":[
               [
                  [
                     "conv2d_101",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ]
         },
         {
            "class_name":"BatchNormalization",
            "name":"batch_normalization_104",
            "config":{
               "momentum":0.99,
               "name":"batch_normalization_104",
               "epsilon":0.001,
               "axis":3,
               "scale":false,
               "beta_constraint":null,
               "gamma_initializer":{
                  "class_name":"Ones",
                  "config":{

                  }
               },
               "gamma_regularizer":null,
               "trainable":true,
               "moving_mean_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               },
               "center":true,
               "moving_variance_initializer":{
                  "class_name":"Ones",
                  "config":{

                  }
               },
               "gamma_constraint":null,
               "beta_regularizer":null,
               "beta_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               }
            },
            "inbound_nodes":[
               [
                  [
                     "conv2d_104",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ]
         },
         {
            "class_name":"Activation",
            "name":"activation_101",
            "config":{
               "activation":"relu",
               "trainable":true,
               "name":"activation_101"
            },
            "inbound_nodes":[
               [
                  [
                     "batch_normalization_101",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ]
         },
         {
            "class_name":"Activation",
            "name":"activation_104",
            "config":{
               "activation":"relu",
               "trainable":true,
               "name":"activation_104"
            },
            "inbound_nodes":[
               [
                  [
                     "batch_normalization_104",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ]
         },
         {
            "class_name":"AveragePooling2D",
            "name":"average_pooling2d_10",
            "config":{
               "strides":[
                  1,
                  1
               ],
               "pool_size":[
                  3,
                  3
               ],
               "name":"average_pooling2d_10",
               "padding":"same",
               "data_format":"channels_last",
               "trainable":true
            },
            "inbound_nodes":[
               [
                  [
                     "max_pooling2d_6",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ]
         },
         {
            "class_name":"Conv2D",
            "name":"conv2d_100",
            "config":{
               "kernel_initializer":{
                  "class_name":"VarianceScaling",
                  "config":{
                     "scale":1.0,
                     "mode":"fan_avg",
                     "distribution":"uniform",
                     "seed":null
                  }
               },
               "kernel_size":[
                  1,
                  1
               ],
               "bias_regularizer":null,
               "activation":"linear",
               "bias_constraint":null,
               "name":"conv2d_100",
               "activity_regularizer":null,
               "padding":"same",
               "dilation_rate":[
                  1,
                  1
               ],
               "kernel_constraint":null,
               "trainable":true,
               "kernel_regularizer":null,
               "strides":[
                  1,
                  1
               ],
               "bias_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               },
               "filters":64,
               "use_bias":false,
               "data_format":"channels_last"
            },
            "inbound_nodes":[
               [
                  [
                     "max_pooling2d_6",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ]
         },
         {
            "class_name":"Conv2D",
            "name":"conv2d_102",
            "config":{
               "kernel_initializer":{
                  "class_name":"VarianceScaling",
                  "config":{
                     "scale":1.0,
                     "mode":"fan_avg",
                     "distribution":"uniform",
                     "seed":null
                  }
               },
               "kernel_size":[
                  5,
                  5
               ],
               "bias_regularizer":null,
               "activation":"linear",
               "bias_constraint":null,
               "name":"conv2d_102",
               "activity_regularizer":null,
               "padding":"same",
               "dilation_rate":[
                  1,
                  1
               ],
               "kernel_constraint":null,
               "trainable":true,
               "kernel_regularizer":null,
               "strides":[
                  1,
                  1
               ],
               "bias_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               },
               "filters":64,
               "use_bias":false,
               "data_format":"channels_last"
            },
            "inbound_nodes":[
               [
                  [
                     "activation_101",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ]
         },
         {
            "class_name":"Conv2D",
            "name":"conv2d_105",
            "config":{
               "kernel_initializer":{
                  "class_name":"VarianceScaling",
                  "config":{
                     "scale":1.0,
                     "mode":"fan_avg",
                     "distribution":"uniform",
                     "seed":null
                  }
               },
               "kernel_size":[
                  3,
                  3
               ],
               "bias_regularizer":null,
               "activation":"linear",
               "bias_constraint":null,
               "name":"conv2d_105",
               "activity_regularizer":null,
               "padding":"same",
               "dilation_rate":[
                  1,
                  1
               ],
               "kernel_constraint":null,
               "trainable":true,
               "kernel_regularizer":null,
               "strides":[
                  1,
                  1
               ],
               "bias_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               },
               "filters":96,
               "use_bias":false,
               "data_format":"channels_last"
            },
            "inbound_nodes":[
               [
                  [
                     "activation_104",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ]
         },
         {
            "class_name":"Conv2D",
            "name":"conv2d_106",
            "config":{
               "kernel_initializer":{
                  "class_name":"VarianceScaling",
                  "config":{
                     "scale":1.0,
                     "mode":"fan_avg",
                     "distribution":"uniform",
                     "seed":null
                  }
               },
               "kernel_size":[
                  1,
                  1
               ],
               "bias_regularizer":null,
               "activation":"linear",
               "bias_constraint":null,
               "name":"conv2d_106",
               "activity_regularizer":null,
               "padding":"same",
               "dilation_rate":[
                  1,
                  1
               ],
               "kernel_constraint":null,
               "trainable":true,
               "kernel_regularizer":null,
               "strides":[
                  1,
                  1
               ],
               "bias_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               },
               "filters":32,
               "use_bias":false,
               "data_format":"channels_last"
            },
            "inbound_nodes":[
               [
                  [
                     "average_pooling2d_10",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ]
         },
         {
            "class_name":"BatchNormalization",
            "name":"batch_normalization_100",
            "config":{
               "momentum":0.99,
               "name":"batch_normalization_100",
               "epsilon":0.001,
               "axis":3,
               "scale":false,
               "beta_constraint":null,
               "gamma_initializer":{
                  "class_name":"Ones",
                  "config":{

                  }
               },
               "gamma_regularizer":null,
               "trainable":true,
               "moving_mean_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               },
               "center":true,
               "moving_variance_initializer":{
                  "class_name":"Ones",
                  "config":{

                  }
               },
               "gamma_constraint":null,
               "beta_regularizer":null,
               "beta_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               }
            },
            "inbound_nodes":[
               [
                  [
                     "conv2d_100",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ]
         },
         {
            "class_name":"BatchNormalization",
            "name":"batch_normalization_102",
            "config":{
               "momentum":0.99,
               "name":"batch_normalization_102",
               "epsilon":0.001,
               "axis":3,
               "scale":false,
               "beta_constraint":null,
               "gamma_initializer":{
                  "class_name":"Ones",
                  "config":{

                  }
               },
               "gamma_regularizer":null,
               "trainable":true,
               "moving_mean_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               },
               "center":true,
               "moving_variance_initializer":{
                  "class_name":"Ones",
                  "config":{

                  }
               },
               "gamma_constraint":null,
               "beta_regularizer":null,
               "beta_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               }
            },
            "inbound_nodes":[
               [
                  [
                     "conv2d_102",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ]
         },
         {
            "class_name":"BatchNormalization",
            "name":"batch_normalization_105",
            "config":{
               "momentum":0.99,
               "name":"batch_normalization_105",
               "epsilon":0.001,
               "axis":3,
               "scale":false,
               "beta_constraint":null,
               "gamma_initializer":{
                  "class_name":"Ones",
                  "config":{

                  }
               },
               "gamma_regularizer":null,
               "trainable":true,
               "moving_mean_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               },
               "center":true,
               "moving_variance_initializer":{
                  "class_name":"Ones",
                  "config":{

                  }
               },
               "gamma_constraint":null,
               "beta_regularizer":null,
               "beta_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               }
            },
            "inbound_nodes":[
               [
                  [
                     "conv2d_105",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ]
         },
         {
            "class_name":"BatchNormalization",
            "name":"batch_normalization_106",
            "config":{
               "momentum":0.99,
               "name":"batch_normalization_106",
               "epsilon":0.001,
               "axis":3,
               "scale":false,
               "beta_constraint":null,
               "gamma_initializer":{
                  "class_name":"Ones",
                  "config":{

                  }
               },
               "gamma_regularizer":null,
               "trainable":true,
               "moving_mean_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               },
               "center":true,
               "moving_variance_initializer":{
                  "class_name":"Ones",
                  "config":{

                  }
               },
               "gamma_constraint":null,
               "beta_regularizer":null,
               "beta_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               }
            },
            "inbound_nodes":[
               [
                  [
                     "conv2d_106",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ]
         },
         {
            "class_name":"Activation",
            "name":"activation_100",
            "config":{
               "activation":"relu",
               "trainable":true,
               "name":"activation_100"
            },
            "inbound_nodes":[
               [
                  [
                     "batch_normalization_100",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ]
         },
         {
            "class_name":"Activation",
            "name":"activation_102",
            "config":{
               "activation":"relu",
               "trainable":true,
               "name":"activation_102"
            },
            "inbound_nodes":[
               [
                  [
                     "batch_normalization_102",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ]
         },
         {
            "class_name":"Activation",
            "name":"activation_105",
            "config":{
               "activation":"relu",
               "trainable":true,
               "name":"activation_105"
            },
            "inbound_nodes":[
               [
                  [
                     "batch_normalization_105",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ]
         },
         {
            "class_name":"Activation",
            "name":"activation_106",
            "config":{
               "activation":"relu",
               "trainable":true,
               "name":"activation_106"
            },
            "inbound_nodes":[
               [
                  [
                     "batch_normalization_106",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ]
         },
         {
            "class_name":"Concatenate",
            "name":"mixed0",
            "config":{
               "axis":3,
               "trainable":true,
               "name":"mixed0"
            },
            "inbound_nodes":[
               [
                  [
                     "activation_100",
                     0,
                     0,
                     {

                     }
                  ],
                  [
                     "activation_102",
                     0,
                     0,
                     {

                     }
                  ],
                  [
                     "activation_105",
                     0,
                     0,
                     {

                     }
                  ],
                  [
                     "activation_106",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ]
         },
         {
            "class_name":"Conv2D",
            "name":"conv2d_110",
            "config":{
               "kernel_initializer":{
                  "class_name":"VarianceScaling",
                  "config":{
                     "scale":1.0,
                     "mode":"fan_avg",
                     "distribution":"uniform",
                     "seed":null
                  }
               },
               "kernel_size":[
                  1,
                  1
               ],
               "bias_regularizer":null,
               "activation":"linear",
               "bias_constraint":null,
               "name":"conv2d_110",
               "activity_regularizer":null,
               "padding":"same",
               "dilation_rate":[
                  1,
                  1
               ],
               "kernel_constraint":null,
               "trainable":true,
               "kernel_regularizer":null,
               "strides":[
                  1,
                  1
               ],
               "bias_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               },
               "filters":64,
               "use_bias":false,
               "data_format":"channels_last"
            },
            "inbound_nodes":[
               [
                  [
                     "mixed0",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ]
         },
         {
            "class_name":"BatchNormalization",
            "name":"batch_normalization_110",
            "config":{
               "momentum":0.99,
               "name":"batch_normalization_110",
               "epsilon":0.001,
               "axis":3,
               "scale":false,
               "beta_constraint":null,
               "gamma_initializer":{
                  "class_name":"Ones",
                  "config":{

                  }
               },
               "gamma_regularizer":null,
               "trainable":true,
               "moving_mean_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               },
               "center":true,
               "moving_variance_initializer":{
                  "class_name":"Ones",
                  "config":{

                  }
               },
               "gamma_constraint":null,
               "beta_regularizer":null,
               "beta_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               }
            },
            "inbound_nodes":[
               [
                  [
                     "conv2d_110",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ]
         },
         {
            "class_name":"Activation",
            "name":"activation_110",
