{
   "keras_version":"2.2.0",
   "class_name":"Model",
   "config":{
      "name":"model_1",
      "input_layers":[
         [
            "input_1",
            0,
            0
         ]
      ],
      "output_layers":[
         [
            "norm_layer",
            0,
            0
         ]
      ],
      "layers":[
         {
            "name":"input_1",
            "class_name":"InputLayer",
            "inbound_nodes":[

            ],
            "config":{
               "dtype":"float32",
               "name":"input_1",
               "batch_input_shape":[
                  null,
                  96,
                  96,
                  3
               ],
               "sparse":false
            }
         },
         {
            "name":"zero_padding2d_1",
            "class_name":"ZeroPadding2D",
            "inbound_nodes":[
               [
                  [
                     "input_1",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ],
            "config":{
               "padding":[
                  [
                     3,
                     3
                  ],
                  [
                     3,
                     3
                  ]
               ],
               "name":"zero_padding2d_1",
               "trainable":true,
               "data_format":"channels_last",
               "dtype":"float32",
               "batch_input_shape":[
                  null,
                  96,
                  96,
                  3
               ]
            }
         },
         {
            "name":"conv1",
            "class_name":"Conv2D",
            "inbound_nodes":[
               [
                  [
                     "zero_padding2d_1",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ],
            "config":{
               "padding":"valid",
               "name":"conv1",
               "trainable":true,
               "strides":[
                  2,
                  2
               ],
               "activation":"linear",
               "bias_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               },
               "use_bias":true,
               "bias_constraint":null,
               "kernel_size":[
                  7,
                  7
               ],
               "filters":64,
               "bias_regularizer":null,
               "dilation_rate":[
                  1,
                  1
               ],
               "data_format":"channels_last",
               "kernel_constraint":null,
               "activity_regularizer":null,
               "kernel_regularizer":null,
               "kernel_initializer":{
                  "class_name":"VarianceScaling",
                  "config":{
                     "distribution":"uniform",
                     "scale":1.0,
                     "mode":"fan_avg",
                     "seed":null
                  }
               }
            }
         },
         {
            "name":"bn1",
            "class_name":"BatchNormalization",
            "inbound_nodes":[
               [
                  [
                     "conv1",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ],
            "config":{
               "name":"bn1",
               "momentum":0.99,
               "trainable":true,
               "gamma_regularizer":null,
               "gamma_initializer":{
                  "class_name":"Ones",
                  "config":{

                  }
               },
               "moving_mean_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               },
               "beta_constraint":null,
               "beta_regularizer":null,
               "beta_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               },
               "epsilon":1e-05,
               "gamma_constraint":null,
               "axis":3,
               "scale":true,
               "moving_variance_initializer":{
                  "class_name":"Ones",
                  "config":{

                  }
               },
               "center":true
            }
         },
         {
            "name":"activation_1",
            "class_name":"Activation",
            "inbound_nodes":[
               [
                  [
                     "bn1",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ],
            "config":{
               "name":"activation_1",
               "trainable":true,
               "activation":"relu"
            }
         },
         {
            "name":"zero_padding2d_2",
            "class_name":"ZeroPadding2D",
            "inbound_nodes":[
               [
                  [
                     "activation_1",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ],
            "config":{
               "padding":[
                  [
                     1,
                     1
                  ],
                  [
                     1,
                     1
                  ]
               ],
               "name":"zero_padding2d_2",
               "trainable":true,
               "data_format":"channels_last"
            }
         },
         {
            "name":"max_pooling2d_1",
            "class_name":"MaxPooling2D",
            "inbound_nodes":[
               [
                  [
                     "zero_padding2d_2",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ],
            "config":{
               "padding":"valid",
               "name":"max_pooling2d_1",
               "trainable":true,
               "data_format":"channels_last",
               "pool_size":[
                  3,
                  3
               ],
               "strides":[
                  2,
                  2
               ]
            }
         },
         {
            "name":"lrn_1",
            "class_name":"Lambda",
            "inbound_nodes":[
               [
                  [
                     "max_pooling2d_1",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ],
            "config":{
               "function_type":"lambda",
               "name":"lrn_1",
               "output_shape":null,
               "trainable":true,
               "function":[
                  "4wEAAAAAAAAAAQAAAAYAAABDAAAAcxwAAAB0AABqAQBqAgB8AABkAQBkAgBkAwBkBACDAQJTKQVO\n2gVhbHBoYWctQxzr4jYaP9oEYmV0YWcAAAAAAADoPykD2gJ0ZtoCbm7aA2xybikB2gF4qQByBwAA\nAPoePGlweXRob24taW5wdXQtMi1iNzNhNjVmYzRkYTI+2gg8bGFtYmRhPgoAAABzAAAAAA==\n",
                  null,
                  null
               ],
               "arguments":{

               },
               "output_shape_type":"raw"
            }
         },
         {
            "name":"conv2",
            "class_name":"Conv2D",
            "inbound_nodes":[
               [
                  [
                     "lrn_1",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ],
            "config":{
               "padding":"valid",
               "name":"conv2",
               "trainable":true,
               "strides":[
                  1,
                  1
               ],
               "activation":"linear",
               "bias_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               },
               "use_bias":true,
               "bias_constraint":null,
               "kernel_size":[
                  1,
                  1
               ],
               "filters":64,
               "bias_regularizer":null,
               "dilation_rate":[
                  1,
                  1
               ],
               "data_format":"channels_last",
               "kernel_constraint":null,
               "activity_regularizer":null,
               "kernel_regularizer":null,
               "kernel_initializer":{
                  "class_name":"VarianceScaling",
                  "config":{
                     "distribution":"uniform",
                     "scale":1.0,
                     "mode":"fan_avg",
                     "seed":null
                  }
               }
            }
         },
         {
            "name":"bn2",
            "class_name":"BatchNormalization",
            "inbound_nodes":[
               [
                  [
                     "conv2",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ],
            "config":{
               "name":"bn2",
               "momentum":0.99,
               "trainable":true,
               "gamma_regularizer":null,
               "gamma_initializer":{
                  "class_name":"Ones",
                  "config":{

                  }
               },
               "moving_mean_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               },
               "beta_constraint":null,
               "beta_regularizer":null,
               "beta_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               },
               "epsilon":1e-05,
               "gamma_constraint":null,
               "axis":3,
               "scale":true,
               "moving_variance_initializer":{
                  "class_name":"Ones",
                  "config":{

                  }
               },
               "center":true
            }
         },
         {
            "name":"activation_2",
            "class_name":"Activation",
            "inbound_nodes":[
               [
                  [
                     "bn2",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ],
            "config":{
               "name":"activation_2",
               "trainable":true,
               "activation":"relu"
            }
         },
         {
            "name":"zero_padding2d_3",
            "class_name":"ZeroPadding2D",
            "inbound_nodes":[
               [
                  [
                     "activation_2",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ],
            "config":{
               "padding":[
                  [
                     1,
                     1
                  ],
                  [
                     1,
                     1
                  ]
               ],
               "name":"zero_padding2d_3",
               "trainable":true,
               "data_format":"channels_last"
            }
         },
         {
            "name":"conv3",
            "class_name":"Conv2D",
            "inbound_nodes":[
               [
                  [
                     "zero_padding2d_3",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ],
            "config":{
               "padding":"valid",
               "name":"conv3",
               "trainable":true,
               "strides":[
                  1,
                  1
               ],
               "activation":"linear",
               "bias_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               },
               "use_bias":true,
               "bias_constraint":null,
               "kernel_size":[
                  3,
                  3
               ],
               "filters":192,
               "bias_regularizer":null,
               "dilation_rate":[
                  1,
                  1
               ],
               "data_format":"channels_last",
               "kernel_constraint":null,
               "activity_regularizer":null,
               "kernel_regularizer":null,
               "kernel_initializer":{
                  "class_name":"VarianceScaling",
                  "config":{
                     "distribution":"uniform",
                     "scale":1.0,
                     "mode":"fan_avg",
                     "seed":null
                  }
               }
            }
         },
         {
            "name":"bn3",
            "class_name":"BatchNormalization",
            "inbound_nodes":[
               [
                  [
                     "conv3",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ],
            "config":{
               "name":"bn3",
               "momentum":0.99,
               "trainable":true,
               "gamma_regularizer":null,
               "gamma_initializer":{
                  "class_name":"Ones",
                  "config":{

                  }
               },
               "moving_mean_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               },
               "beta_constraint":null,
               "beta_regularizer":null,
               "beta_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               },
               "epsilon":1e-05,
               "gamma_constraint":null,
               "axis":3,
               "scale":true,
               "moving_variance_initializer":{
                  "class_name":"Ones",
                  "config":{

                  }
               },
               "center":true
            }
         },
         {
            "name":"activation_3",
            "class_name":"Activation",
            "inbound_nodes":[
               [
                  [
                     "bn3",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ],
            "config":{
               "name":"activation_3",
               "trainable":true,
               "activation":"relu"
            }
         },
         {
            "name":"zero_padding2d_4",
            "class_name":"ZeroPadding2D",
            "inbound_nodes":[
               [
                  [
                     "activation_3",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ],
            "config":{
               "padding":[
                  [
                     1,
                     1
                  ],
                  [
                     1,
                     1
                  ]
               ],
               "name":"zero_padding2d_4",
               "trainable":true,
               "data_format":"channels_last"
            }
         },
         {
            "name":"max_pooling2d_2",
            "class_name":"MaxPooling2D",
            "inbound_nodes":[
               [
                  [
                     "zero_padding2d_4",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ],
            "config":{
               "padding":"valid",
               "name":"max_pooling2d_2",
               "trainable":true,
               "data_format":"channels_last",
               "pool_size":[
                  3,
                  3
               ],
               "strides":[
                  2,
                  2
               ]
            }
         },
         {
            "name":"inception_3a_3x3_conv1",
            "class_name":"Conv2D",
            "inbound_nodes":[
               [
                  [
                     "max_pooling2d_2",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ],
            "config":{
               "padding":"valid",
               "name":"inception_3a_3x3_conv1",
               "trainable":true,
               "strides":[
                  1,
                  1
               ],
               "activation":"linear",
               "bias_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               },
               "use_bias":true,
               "bias_constraint":null,
               "kernel_size":[
                  1,
                  1
               ],
               "filters":96,
               "bias_regularizer":null,
               "dilation_rate":[
                  1,
                  1
               ],
               "data_format":"channels_last",
               "kernel_constraint":null,
               "activity_regularizer":null,
               "kernel_regularizer":null,
               "kernel_initializer":{
                  "class_name":"VarianceScaling",
                  "config":{
                     "distribution":"uniform",
                     "scale":1.0,
                     "mode":"fan_avg",
                     "seed":null
                  }
               }
            }
         },
         {
            "name":"inception_3a_5x5_conv1",
            "class_name":"Conv2D",
            "inbound_nodes":[
               [
                  [
                     "max_pooling2d_2",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ],
            "config":{
               "padding":"valid",
               "name":"inception_3a_5x5_conv1",
               "trainable":true,
               "strides":[
                  1,
                  1
               ],
               "activation":"linear",
               "bias_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               },
               "use_bias":true,
               "bias_constraint":null,
               "kernel_size":[
                  1,
                  1
               ],
               "filters":16,
               "bias_regularizer":null,
               "dilation_rate":[
                  1,
                  1
               ],
               "data_format":"channels_last",
               "kernel_constraint":null,
               "activity_regularizer":null,
               "kernel_regularizer":null,
               "kernel_initializer":{
                  "class_name":"VarianceScaling",
                  "config":{
                     "distribution":"uniform",
                     "scale":1.0,
                     "mode":"fan_avg",
                     "seed":null
                  }
               }
            }
         },
         {
            "name":"inception_3a_3x3_bn1",
            "class_name":"BatchNormalization",
            "inbound_nodes":[
               [
                  [
                     "inception_3a_3x3_conv1",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ],
            "config":{
               "name":"inception_3a_3x3_bn1",
               "momentum":0.99,
               "trainable":true,
               "gamma_regularizer":null,
               "gamma_initializer":{
                  "class_name":"Ones",
                  "config":{

                  }
               },
               "moving_mean_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               },
               "beta_constraint":null,
               "beta_regularizer":null,
               "beta_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               },
               "epsilon":1e-05,
               "gamma_constraint":null,
               "axis":3,
               "scale":true,
               "moving_variance_initializer":{
                  "class_name":"Ones",
                  "config":{

                  }
               },
               "center":true
            }
         },
         {
            "name":"inception_3a_5x5_bn1",
            "class_name":"BatchNormalization",
            "inbound_nodes":[
               [
                  [
                     "inception_3a_5x5_conv1",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ],
            "config":{
               "name":"inception_3a_5x5_bn1",
               "momentum":0.99,
               "trainable":true,
               "gamma_regularizer":null,
               "gamma_initializer":{
                  "class_name":"Ones",
                  "config":{

                  }
               },
               "moving_mean_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               },
               "beta_constraint":null,
               "beta_regularizer":null,
               "beta_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               },
               "epsilon":1e-05,
               "gamma_constraint":null,
               "axis":3,
               "scale":true,
               "moving_variance_initializer":{
                  "class_name":"Ones",
                  "config":{

                  }
               },
               "center":true
            }
         },
         {
            "name":"activation_4",
            "class_name":"Activation",
            "inbound_nodes":[
               [
                  [
                     "inception_3a_3x3_bn1",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ],
            "config":{
               "name":"activation_4",
               "trainable":true,
               "activation":"relu"
            }
         },
         {
            "name":"activation_6",
            "class_name":"Activation",
            "inbound_nodes":[
               [
                  [
                     "inception_3a_5x5_bn1",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ],
            "config":{
               "name":"activation_6",
               "trainable":true,
               "activation":"relu"
            }
         },
         {
            "name":"max_pooling2d_3",
            "class_name":"MaxPooling2D",
            "inbound_nodes":[
               [
                  [
                     "max_pooling2d_2",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ],
            "config":{
               "padding":"valid",
               "name":"max_pooling2d_3",
               "trainable":true,
               "data_format":"channels_last",
               "pool_size":[
                  3,
                  3
               ],
               "strides":[
                  2,
                  2
               ]
            }
         },
         {
            "name":"zero_padding2d_5",
            "class_name":"ZeroPadding2D",
            "inbound_nodes":[
               [
                  [
                     "activation_4",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ],
            "config":{
               "padding":[
                  [
                     1,
                     1
                  ],
                  [
                     1,
                     1
                  ]
               ],
               "name":"zero_padding2d_5",
               "trainable":true,
               "data_format":"channels_last"
            }
         },
         {
            "name":"zero_padding2d_6",
            "class_name":"ZeroPadding2D",
            "inbound_nodes":[
               [
                  [
                     "activation_6",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ],
            "config":{
               "padding":[
                  [
                     2,
                     2
                  ],
                  [
                     2,
                     2
                  ]
               ],
               "name":"zero_padding2d_6",
               "trainable":true,
               "data_format":"channels_last"
            }
         },
         {
            "name":"inception_3a_pool_conv",
            "class_name":"Conv2D",
            "inbound_nodes":[
               [
                  [
                     "max_pooling2d_3",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ],
            "config":{
               "padding":"valid",
               "name":"inception_3a_pool_conv",
               "trainable":true,
               "strides":[
                  1,
                  1
               ],
               "activation":"linear",
               "bias_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               },
               "use_bias":true,
               "bias_constraint":null,
               "kernel_size":[
                  1,
                  1
               ],
               "filters":32,
               "bias_regularizer":null,
               "dilation_rate":[
                  1,
                  1
               ],
               "data_format":"channels_last",
               "kernel_constraint":null,
               "activity_regularizer":null,
               "kernel_regularizer":null,
               "kernel_initializer":{
                  "class_name":"VarianceScaling",
                  "config":{
                     "distribution":"uniform",
                     "scale":1.0,
                     "mode":"fan_avg",
                     "seed":null
                  }
               }
            }
         },
         {
            "name":"inception_3a_3x3_conv2",
            "class_name":"Conv2D",
            "inbound_nodes":[
               [
                  [
                     "zero_padding2d_5",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ],
            "config":{
               "padding":"valid",
               "name":"inception_3a_3x3_conv2",
               "trainable":true,
               "strides":[
                  1,
                  1
               ],
               "activation":"linear",
               "bias_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               },
               "use_bias":true,
               "bias_constraint":null,
               "kernel_size":[
                  3,
                  3
               ],
               "filters":128,
               "bias_regularizer":null,
               "dilation_rate":[
                  1,
                  1
               ],
               "data_format":"channels_last",
               "kernel_constraint":null,
               "activity_regularizer":null,
               "kernel_regularizer":null,
               "kernel_initializer":{
                  "class_name":"VarianceScaling",
                  "config":{
                     "distribution":"uniform",
                     "scale":1.0,
                     "mode":"fan_avg",
                     "seed":null
                  }
               }
            }
         },
         {
            "name":"inception_3a_5x5_conv2",
            "class_name":"Conv2D",
            "inbound_nodes":[
               [
                  [
                     "zero_padding2d_6",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ],
            "config":{
               "padding":"valid",
               "name":"inception_3a_5x5_conv2",
               "trainable":true,
               "strides":[
                  1,
                  1
               ],
               "activation":"linear",
               "bias_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               },
               "use_bias":true,
               "bias_constraint":null,
               "kernel_size":[
                  5,
                  5
               ],
               "filters":32,
               "bias_regularizer":null,
               "dilation_rate":[
                  1,
                  1
               ],
               "data_format":"channels_last",
               "kernel_constraint":null,
               "activity_regularizer":null,
               "kernel_regularizer":null,
               "kernel_initializer":{
                  "class_name":"VarianceScaling",
                  "config":{
                     "distribution":"uniform",
                     "scale":1.0,
                     "mode":"fan_avg",
                     "seed":null
                  }
               }
            }
         },
         {
            "name":"inception_3a_pool_bn",
            "class_name":"BatchNormalization",
            "inbound_nodes":[
               [
                  [
                     "inception_3a_pool_conv",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ],
            "config":{
               "name":"inception_3a_pool_bn",
               "momentum":0.99,
               "trainable":true,
               "gamma_regularizer":null,
               "gamma_initializer":{
                  "class_name":"Ones",
                  "config":{

                  }
               },
               "moving_mean_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               },
               "beta_constraint":null,
               "beta_regularizer":null,
               "beta_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               },
               "epsilon":1e-05,
               "gamma_constraint":null,
               "axis":3,
               "scale":true,
               "moving_variance_initializer":{
                  "class_name":"Ones",
                  "config":{

                  }
               },
               "center":true
            }
         },
         {
            "name":"inception_3a_1x1_conv",
            "class_name":"Conv2D",
            "inbound_nodes":[
               [
                  [
                     "max_pooling2d_2",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ],
            "config":{
               "padding":"valid",
               "name":"inception_3a_1x1_conv",
               "trainable":true,
               "strides":[
                  1,
                  1
               ],
               "activation":"linear",
               "bias_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               },
               "use_bias":true,
               "bias_constraint":null,
               "kernel_size":[
                  1,
                  1
               ],
               "filters":64,
               "bias_regularizer":null,
               "dilation_rate":[
                  1,
                  1
               ],
               "data_format":"channels_last",
               "kernel_constraint":null,
               "activity_regularizer":null,
               "kernel_regularizer":null,
               "kernel_initializer":{
                  "class_name":"VarianceScaling",
                  "config":{
                     "distribution":"uniform",
                     "scale":1.0,
                     "mode":"fan_avg",
                     "seed":null
                  }
               }
            }
         },
         {
            "name":"inception_3a_3x3_bn2",
            "class_name":"BatchNormalization",
            "inbound_nodes":[
               [
                  [
                     "inception_3a_3x3_conv2",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ],
            "config":{
               "name":"inception_3a_3x3_bn2",
               "momentum":0.99,
               "trainable":true,
               "gamma_regularizer":null,
               "gamma_initializer":{
                  "class_name":"Ones",
                  "config":{

                  }
               },
               "moving_mean_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               },
               "beta_constraint":null,
               "beta_regularizer":null,
               "beta_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               },
               "epsilon":1e-05,
               "gamma_constraint":null,
               "axis":3,
               "scale":true,
               "moving_variance_initializer":{
                  "class_name":"Ones",
                  "config":{

                  }
               },
               "center":true
            }
         },
         {
            "name":"inception_3a_5x5_bn2",
            "class_name":"BatchNormalization",
            "inbound_nodes":[
               [
                  [
                     "inception_3a_5x5_conv2",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ],
            "config":{
               "name":"inception_3a_5x5_bn2",
               "momentum":0.99,
               "trainable":true,
               "gamma_regularizer":null,
               "gamma_initializer":{
                  "class_name":"Ones",
                  "config":{

                  }
               },
               "moving_mean_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               },
               "beta_constraint":null,
               "beta_regularizer":null,
               "beta_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               },
               "epsilon":1e-05,
               "gamma_constraint":null,
               "axis":3,
               "scale":true,
               "moving_variance_initializer":{
                  "class_name":"Ones",
                  "config":{

                  }
               },
               "center":true
            }
         },
         {
            "name":"activation_8",
            "class_name":"Activation",
            "inbound_nodes":[
               [
                  [
                     "inception_3a_pool_bn",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ],
            "config":{
               "name":"activation_8",
               "trainable":true,
               "activation":"relu"
            }
         },
         {
            "name":"inception_3a_1x1_bn",
            "class_name":"BatchNormalization",
            "inbound_nodes":[
               [
                  [
                     "inception_3a_1x1_conv",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ],
            "config":{
               "name":"inception_3a_1x1_bn",
               "momentum":0.99,
               "trainable":true,
               "gamma_regularizer":null,
               "gamma_initializer":{
                  "class_name":"Ones",
                  "config":{

                  }
               },
               "moving_mean_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               },
               "beta_constraint":null,
               "beta_regularizer":null,
               "beta_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               },
               "epsilon":1e-05,
               "gamma_constraint":null,
               "axis":3,
               "scale":true,
               "moving_variance_initializer":{
                  "class_name":"Ones",
                  "config":{

                  }
               },
               "center":true
            }
         },
         {
            "name":"activation_5",
            "class_name":"Activation",
            "inbound_nodes":[
               [
                  [
                     "inception_3a_3x3_bn2",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ],
            "config":{
               "name":"activation_5",
               "trainable":true,
               "activation":"relu"
            }
         },
         {
            "name":"activation_7",
            "class_name":"Activation",
            "inbound_nodes":[
               [
                  [
                     "inception_3a_5x5_bn2",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ],
            "config":{
               "name":"activation_7",
               "trainable":true,
               "activation":"relu"
            }
         },
         {
            "name":"zero_padding2d_7",
            "class_name":"ZeroPadding2D",
            "inbound_nodes":[
               [
                  [
                     "activation_8",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ],
            "config":{
               "padding":[
                  [
                     3,
                     4
                  ],
                  [
                     3,
                     4
                  ]
               ],
               "name":"zero_padding2d_7",
               "trainable":true,
               "data_format":"channels_last"
            }
         },
         {
            "name":"activation_9",
            "class_name":"Activation",
            "inbound_nodes":[
               [
                  [
                     "inception_3a_1x1_bn",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ],
            "config":{
               "name":"activation_9",
               "trainable":true,
               "activation":"relu"
            }
         },
         {
            "name":"concatenate_1",
            "class_name":"Concatenate",
            "inbound_nodes":[
               [
                  [
                     "activation_5",
                     0,
                     0,
                     {

                     }
                  ],
                  [
                     "activation_7",
                     0,
                     0,
                     {

                     }
                  ],
                  [
                     "zero_padding2d_7",
                     0,
                     0,
                     {

                     }
                  ],
                  [
                     "activation_9",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ],
            "config":{
               "axis":3,
               "name":"concatenate_1",
               "trainable":true
            }
         },
         {
            "name":"power2_3b",
            "class_name":"Lambda",
            "inbound_nodes":[
               [
                  [
                     "concatenate_1",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ],
            "config":{
               "function_type":"lambda",
               "name":"power2_3b",
               "output_shape":null,
               "trainable":true,
               "function":[
                  "4wEAAAAAAAAAAQAAAAIAAABDAAAAcwgAAAB8AABkAQATUykCTukCAAAAqQApAdoBeHICAAAAcgIA\nAAD6HjxpcHl0aG9uLWlucHV0LTItYjczYTY1ZmM0ZGEyPtoIPGxhbWJkYT5FAAAAcwAAAAA=\n",
                  null,
                  null
               ],
               "arguments":{

               },
               "output_shape_type":"raw"
            }
         },
         {
            "name":"inception_3b_3x3_conv1",
            "class_name":"Conv2D",
            "inbound_nodes":[
               [
                  [
                     "concatenate_1",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ],
            "config":{
               "padding":"valid",
               "name":"inception_3b_3x3_conv1",
               "trainable":true,
               "strides":[
                  1,
                  1
               ],
               "activation":"linear",
               "bias_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               },
               "use_bias":true,
               "bias_constraint":null,
               "kernel_size":[
                  1,
                  1
               ],
               "filters":96,
               "bias_regularizer":null,
               "dilation_rate":[
                  1,
                  1
               ],
               "data_format":"channels_last",
               "kernel_constraint":null,
               "activity_regularizer":null,
               "kernel_regularizer":null,
               "kernel_initializer":{
                  "class_name":"VarianceScaling",
                  "config":{
                     "distribution":"uniform",
                     "scale":1.0,
                     "mode":"fan_avg",
                     "seed":null
                  }
               }
            }
         },
         {
            "name":"inception_3b_5x5_conv1",
            "class_name":"Conv2D",
            "inbound_nodes":[
               [
                  [
                     "concatenate_1",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ],
            "config":{
               "padding":"valid",
               "name":"inception_3b_5x5_conv1",
               "trainable":true,
               "strides":[
                  1,
                  1
               ],
               "activation":"linear",
               "bias_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               },
               "use_bias":true,
               "bias_constraint":null,
               "kernel_size":[
                  1,
                  1
               ],
               "filters":32,
               "bias_regularizer":null,
               "dilation_rate":[
                  1,
                  1
               ],
               "data_format":"channels_last",
               "kernel_constraint":null,
               "activity_regularizer":null,
               "kernel_regularizer":null,
               "kernel_initializer":{
                  "class_name":"VarianceScaling",
                  "config":{
                     "distribution":"uniform",
                     "scale":1.0,
                     "mode":"fan_avg",
                     "seed":null
                  }
               }
            }
         },
         {
            "name":"average_pooling2d_1",
            "class_name":"AveragePooling2D",
            "inbound_nodes":[
               [
                  [
                     "power2_3b",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ],
            "config":{
               "padding":"valid",
               "name":"average_pooling2d_1",
               "trainable":true,
               "data_format":"channels_last",
               "pool_size":[
                  3,
                  3
               ],
               "strides":[
                  3,
                  3
               ]
            }
         },
         {
            "name":"inception_3b_3x3_bn1",
            "class_name":"BatchNormalization",
            "inbound_nodes":[
               [
                  [
                     "inception_3b_3x3_conv1",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ],
            "config":{
               "name":"inception_3b_3x3_bn1",
               "momentum":0.99,
               "trainable":true,
               "gamma_regularizer":null,
               "gamma_initializer":{
                  "class_name":"Ones",
                  "config":{

                  }
               },
               "moving_mean_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               },
               "beta_constraint":null,
               "beta_regularizer":null,
               "beta_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               },
               "epsilon":1e-05,
               "gamma_constraint":null,
               "axis":3,
               "scale":true,
               "moving_variance_initializer":{
                  "class_name":"Ones",
                  "config":{

                  }
               },
               "center":true
            }
         },
         {
            "name":"inception_3b_5x5_bn1",
            "class_name":"BatchNormalization",
            "inbound_nodes":[
               [
                  [
                     "inception_3b_5x5_conv1",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ],
            "config":{
               "name":"inception_3b_5x5_bn1",
               "momentum":0.99,
               "trainable":true,
               "gamma_regularizer":null,
               "gamma_initializer":{
                  "class_name":"Ones",
                  "config":{

                  }
               },
               "moving_mean_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               },
               "beta_constraint":null,
               "beta_regularizer":null,
