{"class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"dtype": "float32", "padding": "valid", "filters": 64, "trainable": true, "activation": "relu", "bias_constraint": null, "strides": [1, 1], "name": "conv2d_1", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "data_format": "channels_last", "use_bias": true, "batch_input_shape": [null, 48, 48, 1], "activity_regularizer": null, "kernel_size": [5, 5], "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "padding": "valid", "pool_size": [5, 5], "data_format": "channels_last", "trainable": true, "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"padding": "valid", "filters": 64, "trainable": true, "activation": "relu", "bias_constraint": null, "strides": [1, 1], "name": "conv2d_2", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "data_format": "channels_last", "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Conv2D", "config": {"padding": "valid", "filters": 64, "trainable": true, "activation": "relu", "bias_constraint": null, "strides": [1, 1], "name": "conv2d_3", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "data_format": "channels_last", "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_1", "padding": "valid", "pool_size": [3, 3], "data_format": "channels_last", "trainable": true, "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"padding": "valid", "filters": 128, "trainable": true, "activation": "relu", "bias_constraint": null, "strides": [1, 1], "name": "conv2d_4", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "data_format": "channels_last", "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Conv2D", "config": {"padding": "valid", "filters": 128, "trainable": true, "activation": "relu", "bias_constraint": null, "strides": [1, 1], "name": "conv2d_5", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "data_format": "channels_last", "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_2", "padding": "valid", "pool_size": [3, 3], "data_format": "channels_last", "trainable": true, "strides": [2, 2]}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"use_bias": true, "trainable": true, "activation": "relu", "activity_regularizer": null, "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "bias_regularizer": null, "kernel_regularizer": null, "units": 1024, "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.2}}, {"class_name": "Dense", "config": {"use_bias": true, "trainable": true, "activation": "relu", "activity_regularizer": null, "name": "dense_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "bias_regularizer": null, "kernel_regularizer": null, "units": 1024, "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "rate": 0.2}}, {"class_name": "Dense", "config": {"use_bias": true, "trainable": true, "activation": "softmax", "activity_regularizer": null, "name": "dense_3", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "bias_regularizer": null, "kernel_regularizer": null, "units": 7, "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}], "keras_version": "2.0.8"}